Autodesk.Revit.DB.Structure.AreaLoadTypeSet
A set that contains areaload types.

Autodesk.Revit.DB.Structure.AreaLoadTypeSet.Insert(Autodesk.Revit.DB.Structure.AreaLoadType)
System.Int32
Insert the specified areaload type into the set.
item: The areaload type to be inserted into the set.
Returns: Returns whether the areaload type was inserted into the set.

Autodesk.Revit.DB.Structure.AreaLoadTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.AreaLoadTypeSet.ReverseIterator
Autodesk.Revit.DB.Structure.AreaLoadTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Structure.AreaLoadTypeSet.ForwardIterator
Autodesk.Revit.DB.Structure.AreaLoadTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Structure.AreaLoadTypeSet.Erase(Autodesk.Revit.DB.Structure.AreaLoadType)
System.Int32
Removes a specified areaload type from the set.
item: The areaload type to be erased.
Returns: The number of areaload types that were erased from the set.

Autodesk.Revit.DB.Structure.AreaLoadTypeSet.Contains(Autodesk.Revit.DB.Structure.AreaLoadType)
System.Boolean
Tests for the existence of a areaload type within the set.
item: The areaload type to be searched for.
Returns: The Contains method returns True if the areaload type is within the set, otherwise False.

Autodesk.Revit.DB.Structure.AreaLoadTypeSet.Clear
void
Removes every areaload type from the set, rendering it empty.

Autodesk.Revit.DB.Structure.AreaLoadTypeSet.Size
System.Int32
get
Returns the number of areaload types that are in the set.

Autodesk.Revit.DB.Structure.AreaLoadTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.